{"pages":[],"posts":[{"title":"用爬虫分析了2020年一年的热搜，我发现了什么？","text":"前言2020年是艰难的一年，但即使再难，也都过去了。 分析一下2020年的新闻热搜，可以大致了解网民都在关注什么。 微博热搜以娱乐为主，头条的热搜更偏向民生与时事。今天，我们先分析分析微博一整年的热搜。 数据抓取由于微博平台不能查看历史热搜，本文所有的数据都是从云合数据旗下的一个热搜榜抓取的，具体地址见文末。 抓取数据的代码是用Python写的，代码非常简单，就是模拟请求和数据统计两个部分。 抓取到了从2020年1月1日到2020年12月31日一共35901条数据，将抓取的数据存入Excel，数据格式如下图： 数据分析用pyecharts做可视化分析，先将所有的热搜数据按照热度做成一个词云。 “词云”是对海量文字内容中出现频率较高的视觉突出，即出现越多的“关键词”字体越大。这里用热度替代了出现次数 结合微博热搜话题搜索量TOP10，哪些热搜热度高就一目了然了。 罗志祥的分手引爆微博，两条热搜霸占全年热搜榜前二名，搜索指数加起来超过了5700万。要知道，鹿晗官宣和关晓彤在一起那一条热搜也只有1700多万搜索指数。 美国总统特朗普从看不起新冠，到最后夫妻双双确诊，打脸来的不要太快。“特朗普夫妇确诊新冠”的新闻也曾引爆微博甚至全球。 在前十榜单里面，“李文亮医生去世”和“李文亮仍在抢救”这两条热搜引人注目。 李文亮医生的事迹在当时引起了一阵轰动，一年的时间快要过去了，“李文亮”这个名字也慢慢不被人们提起，后人也许也不会知道这段故事。但人们不提，不代表忘记，互联网也是有记忆的，每当回忆起这次疫情，李文亮医生依旧站在那里。让我们向英雄致敬！ 热词回顾一年的热搜，和疫情相关的词汇出现的比较高频，“抗疫”成为了2020年中国甚至世界的主旋律。 2020年中美关系因美方一意孤行而比较紧张，加上美国疫情的不可控发展，“美国”和“特朗普”也频频登上热搜。 我还生成了“道歉”，“帅”，“结婚”，“分手”，“心疼”等关键字词云，大部分都是和娱乐圈相关的，今天你道歉，明天我发声。我的感觉就是，贵圈真乱。 人名出现次数排行榜统计了上热搜次数最多的前40个人。大部分都是娱乐圈的，其中周杰伦是榜中唯一一个没有开通微博的明星。 美国现总统特朗普和下任总统拜登因为选举和美国疫情不可控等因素频频上热搜，特朗普更是差不多平均一天上一次热搜。 获颁“共和国勋章”的敢医敢言的钟南山2020年上了196次热搜，从非典到新冠，攸关生命的大考，他从不缺位，向钟老致敬。 通过《陈情令》爆火的王一博和肖战，分别排在第四名和第六名。 有意思是，从2011年《宫》播出之后，杨幂每年上热搜次数就没有跌出过前10。 2020年，是直播带货蓬勃发展的一年，李佳琦和薇娅两个带货之王也频频登上热搜，甚至李佳琦以103次的成绩排到了第八名。 归国四子黄子韬、鹿晗、吴亦凡和张艺兴也依然保持热度，都有着比较靠前的排名。 2020年湖人队民宿科比坠机身亡，因此也上了69次热搜，R.I.P。 不开通微博的周董周杰伦，凭借自己的实力和强大的粉丝群体，强行上了59次热搜，是为数不多不靠炒作就能登上这个榜单的明星了。 最近一个月才大火的丁真，就以47次热搜的成绩登上排行榜，同时丁真也是12月上热搜次数最多的人。 总结 2020年微博热搜主旋律——抗疫 2020年上微博热搜次数最多的人——特朗普 2020年上微博热搜次数最多的娱乐明星——易烊千玺 2020年热度最高的微博热搜——罗志祥周扬青分手 以上所有的数据都基于热搜平台，一切信息都可以在平台查询。 写到这里，如果你问“买热搜”真的存在吗？ 我会告诉你，“买热搜”真的存在。我分析了几年的微博热搜数据，确实发现了一些问题，有些热搜非常莫名其妙，热度来得快去的也快，再结合一下其他平台的数据就能容易分析出这个热搜的真实性了。 但如果你问我有哪些明星买了热搜，我不能告诉你，为什么呢？因为我告诉你我的号就没了。 如果你实在有兴趣，公众号后台回复“热搜”，我会给你一份2020一整年的微博热搜数据Excel，你可以自己去慢慢分析。 写在最后以上所有的数据都基于热搜平台，一切信息都可以在平台查询。 本人才疏学浅，如有错误欢迎指出！ 最后，感谢您的阅读。 您的点赞和转发都是对我最大的支持，十分欢迎并感谢您的关注。 本文所有的资料和源码关注公众号‘CoderW’回复‘热搜’即可获取 热搜平台：https://www.enlightent.cn/research/rank/weiboSearchRank 参考文章: https://mp.weixin.qq.com/s/BD1rqPCQvhYP4i4bef_BAg。","link":"/2021/04/08/%E7%94%A8%E7%88%AC%E8%99%AB%E5%88%86%E6%9E%90%E4%BA%862020%E5%B9%B4%E4%B8%80%E5%B9%B4%E7%9A%84%E7%83%AD%E6%90%9C%EF%BC%8C%E6%88%91%E5%8F%91%E7%8E%B0%E4%BA%86%E4%BB%80%E4%B9%88%EF%BC%9F/"}],"tags":[{"name":"JVM","slug":"JVM","link":"/tags/JVM/"}],"categories":[]}